[
  {
    "path": "posts/project-proposal/",
    "title": "Visual Analytics Project Proposal",
    "description": "Proposal for the project work for this course.",
    "author": [
      {
        "name": "Louelle TEO Fengmin",
        "url": {}
      },
      {
        "name": "Jason TEY Shou Heng",
        "url": {}
      },
      {
        "name": "WONG Kian Hoong (Andy)",
        "url": {}
      }
    ],
    "date": "2021-02-28",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nBackground\r\nMotivation\r\nProject Objectives\r\nTimeline of Project\r\nProposed Scope and Methodology\r\nApplication Features\r\nSoftware Tool\r\nR Packages\r\nTeam Members\r\nReferences\r\n\r\nBackground\r\nAirbnb, Inc. is one of the most well-known vacation rental platforms in the world. With almost 3 million hosts listing over 7 million accommodations worldwide,\r\nUnited States, as the origin of the app, has the largest number of listings at 660,000, with the company having an estimated US$33.8B economic impact on the economy in 2018. Australia - the focus of this project - saw the company having an economic impact of US$4.4B in the same period, and ranked as the top-10 destination for both inbound and outbound guests, as well as having its cities listed as some of the most popular cities for bookings. In Australia, Airbnb is taking up more than two-thirds of the short-term rental market share.\r\nPrior to the Covid-19 pandemic, the company was valued at US$35B but dropped by 48.6% to around $18B, and the company is estimated to have lost as much as 54% of its revenue in 2020 due to the virus. However, Airbnb’s IPO in December 2020 had its valuation topping $100B, indicating optimism in its recovery post-COVID.\r\nAirbnb is popular with holidaymakers for the wide choice of rental accommodations catering to different needs.Given the popularity of Airbnb to holidaymakers, people are also eager to list their accommodation for vacationers to hire.\r\nThis project provides an analytics platform for interested parties (especially non-data specialists) to conduct statistical analysis on the Australia Airbnb dataset using simple and user-friendly interactive dashboards that does not require programming knowledge.\r\nMotivation\r\nThe dataset that has be scrapped on the Airbnb web and made publicly available by Inside Airbnb provides geospatial, textual (description of house, house rules, reviews etc.), and quantitative data (per-night price, average ratings, available facilities etc.) on each of the listings listed on the web.\r\nThe abundance of Airbnb data provides great opportunity to conduct a variety of data analyses to understand the residential short-lease rental market. Exploratory data analysis allows broad overview of the short-term residential rental market captured by Airbnb, cluster and geospatial analysis provides a deeper understanding into the different types of dwelling units available on the web, as well as the geographical distribution and patterns of the rental market. Text analysis is also plausible with the rich multitude of textual data made available from the descriptive nature of dataset, to peer into the linguistic association of different attributes of the rental market. Finally, regression analysis complements the other methods to dive deep into the various factors that could crack the code to a successful rental listing and vibrant residential market.\r\nWhile there are studies and reports available on these various aspects of the short-lease rental market in the context of individual countries, a prominent short-coming is the lack of publicly and readily accessible data analytic tools for non-specialist to explore unmask the plethora of knowledge beneath. This project hence aims to provide an application for Airbnb hosts, policymakers, or common man and woman alike who are keen on exploring the interesting geospatial, textual, and statistical relationship of the various interacting elements affecting the Airbnb short-term residential rental market.\r\nWhile this project focuses on one particular country - Australia - the analytical tools and methods are easily transferable to incorporate datasets from other region, country, or city, subject to the availability of dataset and processing capabilities of the hardware.\r\nProject Objectives\r\nDevelop an interactive application for end-users\r\nVisual representation of accommodation listings by region\r\nTimeline of Project\r\nOur project timeline will be as follows:\r\nTimeline\r\nProposed Scope and Methodology\r\nThis project will focus on Australia as the location of interest.\r\n\r\nThe methodologies that will be used are:\r\nExploratory and Exploratory Spatial Data Analysis (EDA & ESDA)\r\nCluster Analysis\r\nText Analytics\r\nMulti-linear Regression\r\nApplication Features\r\nThe application will consist of five main sections, one for each analysis approach. Exploratory Data Analysis Cluster Analysis Spatial Cluster Analysis Text Analysis Multilinear Regression Analysis\r\nSoftware Tool\r\nTha interactive application, together with all documentation such as this project proposal and the final report will be written in R using RStudio.\r\nR Packages\r\nThese are the R packages used:\r\nGeneral\r\nDT: https://cran.r-project.org/web/packages/DT\r\nggplot2: https://cran.r-project.org/web/packages/ggplot2/index.html\r\nGGally: https://cran.r-project.org/web/packages/GGally\r\nleaflet: https://cran.r-project.org/web/packages/leaflet\r\nlubridate: https://cran.r-project.org/web/packages/lubridate/index.html\r\nplotly: https://cran.r-project.org/web/packages/plotly\r\nposterdown: https://cran.r-project.org/web/packages/posterdown\r\nRColorBrewer: https://cran.r-project.org/web/packages/RColorBrewer\r\nreadr: https://cran.r-project.org/web/packages/readr\r\nreadxl: https://cran.r-project.org/web/packages/readxl\r\nshiny: https://shiny.rstudio.com\r\nshinythemes: https://cran.r-project.org/web/packages/shinythemes\r\nshinyWidgets: https://cran.r-project.org/web/packages/shinyWidgets\r\ntidyverse: https://www.tidyverse.org\r\ntmap: https://cran.r-project.org/web/packages/tmap\r\nExploratory Data Analytics\r\ncorrplot: https://cran.r-project.org/web/packages/corrplot\r\npurr: https://cran.r-project.org/web/packages/purrr/index.html\r\nrgdal: https://cran.r-project.org/web/packages/rgdal\r\nrgeos: https://cran.r-project.org/web/packages/rgeos\r\nsf: https://cran.r-project.org/web/packages/sf\r\nsp: https://cran.r-project.org/web/packages/sp\r\nspdep: https://cran.r-project.org/web/packages/spdep\r\nCluster Analysis\r\ncluster: https://cran.r-project.org/web/packages/cluster/index.html\r\ndendextend https://cran.r-project.org/web/packages/dendextend\r\nfactoextra: https://cran.r-project.org/web/packages/factoextra/index.html\r\nggdendro: https://cran.r-project.org/web/packages/ggdendro\r\nText Analysis\r\nquanteda: https://cran.r-project.org/web/packages/quanteda/index.html\r\nSnowballC: https://cran.r-project.org/web/packages/SnowballC/index.html\r\nspacyr: https://cran.r-project.org/web/packages/spacyr/index.html\r\nstringr: https://cran.r-project.org/web/packages/stringr/index.html\r\ntm: https://cran.r-project.org/web/packages/tm/index.html\r\nwordcloud: https://cran.r-project.org/web/packages/wordcloud/\r\nMultilinear Regression\r\nMASS: https://cran.r-project.org/web/packages/MASS/index.html\r\nTeam Members\r\nLouelle TEO Fengmin\r\nJason TEY Shou Heng\r\nWONG Kian Hoong (Andy)\r\nReferences\r\n2021 Airbnb Statistics: Usage, Demographics, and Revenue Growth * Airbnb, Inc.\r\nAustralian region boundaries in Tableau\r\nAirbnb wins the battle for Australia’s short-term rental market\r\nInside Airbnb\r\niProperty Management: Airbnb Statistics\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-03T21:25:11+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Visual Analytics Project",
    "description": "Welcome to our new blog, Visual Analytics Project. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-02-24",
    "categories": [],
    "contents": "\r\ntrial commit Andy test\r\nlouelle confirm again\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-24T22:48:39+08:00",
    "input_file": {}
  }
]
